<?php
/*
for ( $i = 1 ; $i < 20 ; $i++ ){

    echo $i . "<br>" ;
    
}



// **************************************************************



<select name="year">

     for($i=1900 ; $i<= 2020 ; $i++){
         
        echo "<option value = $i>" . $i . "</option>" ;
       }
?>
</select>

*/


// *************************************************************


/*
$langs = array("html", "css" , "js" , "php");

echo count($langs);// لمعرفة عدد عناصر المصفوفة

echo "<ul>" ;

    for($i = 0 ; $i < count($langs) ; $i++ ){

        echo "<li>" . $langs[$i] . "</li>" ;
    }

echo "</ul>" ;


*/

// *************************************************************



?>

